rokath/trice/test/Backup/TASKING_STM32F4DISC_Audio_Service/SoftwarePlatform/Configuration/stm32f4xx_cmsis_cfg.h
/*
 *  Software Platform Generated File
 *  --------------------------------
 */

#ifndef _SWP_STM32F4XX_CMSIS_CFG_H
#define _SWP_STM32F4XX_CMSIS_CFG_H

#include <stdbool.h>
#include <stdint.h>

#define STM32F4XX_CMSIS_CLKSRC_HSI  0
#define STM32F4XX_CMSIS_CLKSRC_HSE  1
#define STM32F4XX_CMSIS_CLKSRC_PLLCLKBYHSI  2
#define STM32F4XX_CMSIS_CLKSRC_PLLCLKBYHSE  3

#define STM32F4XX_CMSIS_PLL_P_2  0
#define STM32F4XX_CMSIS_PLL_P_4  1
#define STM32F4XX_CMSIS_PLL_P_6  2
#define STM32F4XX_CMSIS_PLL_P_8  3

#define STM32F4XX_CMSIS_AHB_1  0
#define STM32F4XX_CMSIS_AHB_2  8
#define STM32F4XX_CMSIS_AHB_4  9
#define STM32F4XX_CMSIS_AHB_8  10
#define STM32F4XX_CMSIS_AHB_16  11
#define STM32F4XX_CMSIS_AHB_64  12
#define STM32F4XX_CMSIS_AHB_128  13
#define STM32F4XX_CMSIS_AHB_256  14
#define STM32F4XX_CMSIS_AHB_512  15

#define STM32F4XX_CMSIS_APB1_1  0
#define STM32F4XX_CMSIS_APB1_2  4
#define STM32F4XX_CMSIS_APB1_4  5
#define STM32F4XX_CMSIS_APB1_8  6
#define STM32F4XX_CMSIS_APB1_16  7

#define STM32F4XX_CMSIS_APB2_1  0
#define STM32F4XX_CMSIS_APB2_2  4
#define STM32F4XX_CMSIS_APB2_4  5
#define STM32F4XX_CMSIS_APB2_8  6
#define STM32F4XX_CMSIS_APB2_16  7

#define STM32F4XX_CMSIS_MCO1SRC_HSI  0
#define STM32F4XX_CMSIS_MCO1SRC_LSE  1
#define STM32F4XX_CMSIS_MCO1SRC_HSE  2
#define STM32F4XX_CMSIS_MCO1SRC_PLL  3

#define STM32F4XX_CMSIS_MCO1PRE_1  0
#define STM32F4XX_CMSIS_MCO1PRE_2  4
#define STM32F4XX_CMSIS_MCO1PRE_3  5
#define STM32F4XX_CMSIS_MCO1PRE_4  6
#define STM32F4XX_CMSIS_MCO1PRE_5  7

#define STM32F4XX_CMSIS_MCO2SRC_SYSCLK  0
#define STM32F4XX_CMSIS_MCO2SRC_PLLI2S  1
#define STM32F4XX_CMSIS_MCO2SRC_HSE  2
#define STM32F4XX_CMSIS_MCO2SRC_PLL  3

#define STM32F4XX_CMSIS_MCO2PRE_1  0
#define STM32F4XX_CMSIS_MCO2PRE_2  4
#define STM32F4XX_CMSIS_MCO2PRE_3  5
#define STM32F4XX_CMSIS_MCO2PRE_4  6
#define STM32F4XX_CMSIS_MCO2PRE_5  7


#define STM32F4XX_CMSIS_TARGET  1
#define STM32F4XX_CMSIS_CLKSRC  STM32F4XX_CMSIS_CLKSRC_PLLCLKBYHSE
#define STM32F4XX_CMSIS_HSE  25
#define STM32F4XX_CMSIS_PLL_M  25
#define STM32F4XX_CMSIS_PLL_N  336
#define STM32F4XX_CMSIS_PLL_P  STM32F4XX_CMSIS_PLL_P_2
#define STM32F4XX_CMSIS_AHB  STM32F4XX_CMSIS_AHB_2
#define STM32F4XX_CMSIS_CLOCKHZ  84000000
#define STM32F4XX_CMSIS_APB1  STM32F4XX_CMSIS_APB1_4
#define STM32F4XX_CMSIS_APB2  STM32F4XX_CMSIS_APB2_2
#define STM32F4XX_CMSIS_PLL_Q  7
#define STM32F4XX_CMSIS_MCO1SRC  STM32F4XX_CMSIS_MCO1SRC_HSI
#define STM32F4XX_CMSIS_MCO1PRE  STM32F4XX_CMSIS_MCO1PRE_1
#define STM32F4XX_CMSIS_MCO2SRC  STM32F4XX_CMSIS_MCO2SRC_SYSCLK
#define STM32F4XX_CMSIS_MCO2PRE  STM32F4XX_CMSIS_MCO2PRE_1

#endif /* _SWP_STM32F4XX_CMSIS_CFG_H */
